<?php
	/*
		Кузнецов М.В., Симдянов И.В. - PHP. Практика создания Web-сайтов (2-е издание) - 2009
		Листинг 2.125. Установка соединения с MySQL-сервером (config.php) - стр. 207
	 */
	 
	// Адрес сервера MySQL
	$dblocation = "localhost";
	// Имя базы данных на хостинге или локальной машине
	$dbname = "forum";
	// Имя пользователя базы данных
	$dbuser = "root";
	// и его пароль
	$dbpasswd = "sql12345";
	
	// Устанавливаем соединение с базой данных
	$dbcnx = @mysql_connect($dblocation, $dbuser, $dbpasswd);
	if (!$dbcnx) {
		exit("<P>В настоящий момент сервер базы данных не доступен, 
		поэтому корректное отображение страницы невозможно.</P>");
	}
	// Выбираем базу данных
	if (!@mysql_select_db($dbname, $dbcnx)) {
		exit("<P>В настоящий момент база данных не доступна, 
		поэтому корректное отображение страницы невозможно.</P>");
	}
	
	// Устанавливаем кодировку соединения. Следует выбрать ту кодировку, 
	// в которой данные будут отправляться MySQL-серверу
	@mysql_query("SET NAMES 'cp1251'");
	echo("Кодировка соединения с СУБД MySQL: <i>Windows-1251</i><br>");
?>