<?php
	/*
		Кузнецов М.В., Симдянов И.В. - PHP. Практика создания Web-сайтов (2-е издание) - 2009
		Листинг 3.10. Формирование HTTP-заголовка Content-length - стр. 228
	 */
	 
	// Весь вывод направляем в буфер
	ob_start();
	
	// Выводим содержимое страницы
	for($i = 0; $i < 300000; $i++)
	{
		echo "01\r\n";
	}
	
	// Отправляем клиенту размер страницы
	// в HTTP-заголовке Content-length
	header("Content-length: ".ob_get_length());
	
	// Отправляем содержимое буфера вывода клиенту
	ob_end_flush();
?>