<?php
	/*
		Кузнецов М.В., Симдянов И.В. - PHP. Практика создания Web-сайтов (2-е издание) - 2009
		Листинг 3.32. Загрузка страницы с удалённого хоста (вариант 2) - стр. 248
	 */
	 
	// Получаем дескриптор удалённой страницы
	$fd = fopen("http://www.softtime.ru/", "r");
	if(!$fd)
	{
		exit("Запрашиваемая страница не найдена");
	}
	$content = "";
	// Чтение содержимого файла в переменную $content
	while(!feof($fd))
	{
		$content .= fgets($fd, 1024);
	}
	// Закрываем открытый указатель файла
	fclose($fd);
	
	// Сохраняем содержимое страницы в файле
	$fd = fopen("url-2.txt", "w");
	fwrite($fd, $content);
	fclose($fd);
?>