<?php
	/*
		Кузнецов М.В., Симдянов И.В. - PHP. Практика создания Web-сайтов (2-е издание) - 2009
		Листинг 3.11. Изменение типа файла - стр. 229
	 */
	 
	// Весь вывод направляем в буфер
	ob_start();
	
	// Выводим содержимое страницы
	for($i = 0; $i < 300000; $i++)
	{
		echo "01<br>";
	}
	
	// Задаём имя, которое будет предложено
	// клиенту для сохранения файла
	header("Content-Disposition: attachment; filename=text.txt");
	// В качестве типа файла задаём бинарный поток
	header("Content-type: application/octet-stream");
	// Отправляем клиенту размер страницы
	// в HTTP-заголовке Content-length
	header("Content-length: ".ob_get_length());
	
	// Отправляем содержимое буфера вывода клиенту
	ob_end_flush();
?>