<?php
	/*
		Кузнецов М.В., Симдянов И.В. - PHP. Практика создания Web-сайтов (2-е издание) - 2009
		Листинг 1.10. Получение структуры объекта класса employee - стр. 19
	 */
	 
	// Подключаем объявление класса
	require_once("class.employee.php");
	
	// Объявляем объект класса employee
	$emp = new employee();
	
	// Передаём значения членам класса
	$emp->surname = "Борисов";
	$emp->name = "Игорь";
	$emp->patronymic = "Иванович";
	$emp->set_age(23);
	
	// Выводим структуру объекта
	echo "<pre>";
	print_r($emp);
	echo "</pre>";
?>