<?php
	/*
		Кузнецов М.В., Симдянов И.В. - PHP. Практика создания Web-сайтов (2-е издание) - 2009
		Листинг 1.9. Использование класса employee - стр. 18
	 */
	 
	// Подключаем объявление класса
	require_once("class.employee.php");
	
	// Объявляем объект класса employee
	$emp = new employee();
	
	// Передаём значения членам класса
	$emp->surname = "Борисов";
	$emp->name = "Игорь";
	$emp->patronymic = "Иванович";
	if(!$emp->set_age(23))
	{
		exit("Ошибка вычисления возраста");
	}
	echo $emp->get_full_info(); // Борисов Игорь Иванович (23)
?>