<?php
	/*
		Кузнецов М.В., Симдянов И.В. - PHP. Практика создания Web-сайтов (2-е издание) - 2009
		Листинг 2.10. Выбор базы данных при помощи функции - стр. 109
	 */
	 
	// Адрес сервера MySQL
	$dblocation = "localhost";
	// Имя базы данных
	$dbname = "cdcol";
	// Имя пользователя базы данных
	$dbuser = "root";
	// и его пароль
	$dbpasswd = "sql12345";
	
	// Устанавливаем соединение с базой данных
	$dbcnx = @mysql_connect($dblocation, $dbuser, $dbpasswd);
	if (!$dbcnx) {
		exit("<P>В настоящий момент сервер базы данных не доступен, 
		поэтому корректное отображение страницы невозможно.</P>");
	}
	// Выбираем базу данных
	if (!@mysql_select_db($dbname, $dbcnx)) {
		exit("<P>В настоящий момент база данных не доступна, 
		поэтому корректное отображение страницы невозможно.</P>");
	}
	
	// Настраиваем кодировку соединения
	@mysql_query("SET NAMES 'cp1251'");
	echo("Кодировка соединения с СУБД MySQL <i>Windows-1251</i>");
?>