<?php
	/*
		Кузнецов М.В., Симдянов И.В. - PHP. Практика создания Web-сайтов (2-е издание) - 2009
		Листинг 5.16. Подбор пароля, зашифрованного с помощью MD5 - стр. 342
	 */
	 
	// Устанавливаем неограниченное время выполнения скрипта
	set_time_limit(0);
	
	// Читаем пароли из файла password
	//$pass = file("password");
	$pass = file("password_1");
	echo decrypt_md5(trim($pass[0]), "");
	
	/*echo "<pre>";
	print_r($pass);
	echo "</pre>";*/
	
	/*foreach($pass as $password)
	{
		// Замеряем время, затраченное на подбор пароля
		$begin = time();
		echo decrypt_md5(trim($password), "");
		$end = time();
		echo "	(На подбор затрачено ".($end -$begin)." секунд) <br>";
	}*/
	
	// Функция посимвольного перебора пароля
	// $pass - расшифровываемый пароль
	// $answer - текущий ответ, при первом вызове - пустая строка
	function decrypt_md5($pass, $answer)
	{
		/*$arr = array('a', 'b', 'c', 'd', 'e', 'f', 
					'g', 'h', 'i', 'j', 'k', 'l', 
					'm', 'n', 'o', 'p', 'q', 'r', 's', 
					't', 'u', 'v', 'w', 'x', 'y', 'z');*/
		
		$arr = array('а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 
					'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 
					'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ь', 'ы', 'ъ', 'э', 'ю', 'я');
		
		/*$arr = array('а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 
					'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 
					'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ь', 'ы', 'ъ', 'э', 'ю', 'я', 
					'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 
					'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 
					'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ь', 'Ы', 'Ъ', 'Э', 'Ю', 'Я');*/
		// Будем считать, что пароль не превышает
		// 4 символов
		$max_number = 4;
		if (strlen($answer) > $max_number) return;
		for ($j = 0; $j < count($arr); $j++)
		{
			$temp = $answer.$arr[$j];
			if (md5($temp) == $pass) return $temp;
			// Рекурсивно вызываем функцию для увеличения
			// длины подбираемого пароля
			$result = decrypt_md5($pass, $temp);
			// Если функция возвращает непустую строку, 
			// следовательно, найден ответ и дальше искать 
			// не следует
			if (strlen($result) > 0) return $result;
		}
	}
?>