<?php
	/*
		Кузнецов М.В., Симдянов И.В. - PHP. Практика создания Web-сайтов (2-е издание) - 2009
		Листинг 4.18. Количество файлов в директории - стр. 311
	 */

	//////////////////////////////////////////////////////////
	// Рекурсивная функция - спускаемся вниз по директории
	//////////////////////////////////////////////////////////
	function scan_dir($dirname)
	{
		// Открываем текущую директорию
		$dir = opendir($dirname);
		// Читаем директорию в цикле
		while (($file = readdir($dir)) !== false)
		{
			// Проверяем, не равно ли значение переменной
			// $file текущей или вышележащей директории
			if ($file != "." && $file != "..")
			{
				// Если перед нами директория, вызываем рекурсивно
				// функцию scan_dir
				if (is_dir("$dirname/$file"))
				{
					echo "$dirname/$file - ".file_count("$dirname/$file")."<br>";
					scan_dir("$dirname/$file");
				}
			}
		}
		// Закрываем директорию
		closedir($dir);
	}
	
	//////////////////////////////////////////////////////////
	// Функция, вычисляющая количество файлов в директории
	//////////////////////////////////////////////////////////
	function file_count($dirname)
	{
		// Переменная для подсчёта
		$count = 0;
		// Открываем директорию
		$dir = opendir($dirname);
		// Считываем её содержимое в цикле
		while (($file = readdir($dir)))
		{
			// Если текущий объект является файлом - считываем его
			if (is_file("$dirname/$file"))
			{
				++$count;
			}
		}
		// Закрываем директорию
		closedir($dir);
		return $count;
	}
	
	// Имя директории
	$dirname = "../../Kuznecov_Simdaynov_PHP_Sozdanie_Web-saita_2009";
	//$dirname = "c:/xampp/htdocs/admin";
	//$dirname = "//SERV/temp/серт/Wex В";
	//$dirname = "//SERV/temp/серт/Wex В/Фланцы";
	//$dirname = "//SERV/temp/серт/Wex В/НИППЕЛЬ/25,4";
	
	// Вызов функции, осуществляющей рекурсивный спуск
	// по поддиректориям корневой директории
	scan_dir($dirname);
?>