<?php
	/*
		Кузнецов М.В., Симдянов И.В. - PHP. Практика создания Web-сайтов (2-е издание) - 2009
		Листинг 6.4. Обработчик HTML-формы (файл handler.php) - стр. 376
	 */
	
	// Если поле first не заполнено, выводим сообщение
	// об ошибке
	if (empty($_POST['first'])) exit("Текстовое поле не заполнено");
	
	// Открываем файл text.txt на запись
	$fd = fopen("text.txt", "a");
	if (!$fd) exit("Невозможно открыть файл");
	// Записываем введённую пользователем строку
	// в текстовый файл
	fwrite($fd, "$_POST[first]\r\n");
	// Закрываем файл
	fclose($fd);
	
	// Осуществляем редирект на главную страницу
	@header("Location: index.php");
?>